{
    "methods": [
        {
            "id": 0,
            "name": "Fixed point scoring",
            "description": "Należy rozdzielić 100 punktów pomiędzy wszystkie kryteria. Im większa liczba punktów przydzielona do danego kryterium, tym jest ono ważniejsze. Każde kryterium musi mieć przypisaną wartość. Poniżej pod listą kryteriow wyświetlana jest suma punktów obecnie wpisana w pola, by ułatwić liczenie już wpisanych wartości."
        },
        {
            "id": 1,
            "name": "Ranking method",
            "description": "Należy zrobić ranking kryteriów, podając wartości od 1 do 10. Najważniejsze kryterium ma pozycje 1, natomiast najmniej ważne pozycje 10. Ranking nie może zawierać remisów."
        },
        {
            "id": 2,
            "name": "Smart method",
            "description": "Należy przypisać punkty do kryteriów w taki sposób, by najmniej ważne kryterium miało wartość 10, a ważniejsze kryteria miały coraz większą wartość. Im bardziej ważne kryterium względem poprzednich, tym powinno mieć większą różnicę w wartości względem poprzednich mniej ważnych. Punkty przypisane do kryteriów nie powinny się powtarzać."
        },
        {
            "id": 3,
            "name": "Ratio weighting method",
            "description": "Należy przypisać punkty do kryteriów tak, by najmniej ważne kryterium miało wartość 10, natomiast kolejne ważniejsze były wielokrotnościami liczby 10 (czyli np 20, 30, 40, 70 itd.). Im większa rożnica pomiędzy wartościami, tym ważniejsze jest kryterium względem poprzednich mniej ważnych. Wartości nie powinny się powtarzać."
        },
        {
            "id": 4,
            "name": "AHP method",
            "description": "Do wykonania jest 45 porownań. Lista kryteriów zawiera oznaczenia każdego z nich (C1, C2 ..). Oznaczenia te są użyte na dole pod tabelą w celu pokazania, które kryteria porównujemy. Należy wybrać, które z 2 kryteriów jest ważniejsze, a następnie wybrać relację pomiędzy nimi. Do wyboru jest 9 wartości opisanych słownie. Po wypełnieniu obu pól, należy kliknąć 'DALEJ', po czym automatycznie wypełnią się wartości w Tabeli oraz pod Tabelą wyświetli się kolejna para kryteriów do porównania."
        }
    ],
    "description": "Na podstawie wcześniejszej ankiety wybrałem 10 kryteriów, które uzyskały największą liczbę głosów. Teraz Waszym zadaniem będzie podanie wartości, które będą oddawać to, jak bardzo ważne jest dla Was każde z kryteriów przy wyborze lokalizacji mieszkania. Czeka Was 5 punktów do wypełnienia, a do każdego z nich umieściłem krótki opis z instrukcjami co należy wykonać w każdym kroku. Po podaniu wartości, każdy krok powinien zostać przez Was oceniony za pomocą gwiazdek na dole strony według odczuć co do trudności ustalenia wartości. Formularz działa tak, że do następnego kroku można przejść dopiero po podaniu wszystkich wartości w kroku i podaniu oceny.",
    "criteria": [
        {
            "id": 0,
            "name": "Liczba kilometrów do centrum (Brama Portowa)"
        },
        {
            "id": 1,
            "name": "Liczba kilometrów do parku"
        },
        {
            "id": 2,
            "name": "Liczba kilometrów do lasu"
        },
        {
            "id": 3,
            "name": "Liczba kilometrów do jeziora"
        },
        {
            "id": 4,
            "name": "Liczba kilometrów do pracy"
        },
        {
            "id": 6,
            "name": "Liczba kilometrów do sklepu"
        },
        {
            "id": 7,
            "name": "Liczba kilometrów do obiektów sportowych"
        },
        {
            "id": 8,
            "name": "Dostęp do miejsc parkingowych"
        },
        {
            "id": 9,
            "name": "Opinia o dzielnicy"
        },
        {
            "id": 10,
            "name": "Liczba kilometrów do przystanku"
        }
    ]
}